app/controllers/products_controller.rb

    def update
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Super Smartphone"], ["description", "Updated description"], ["price", 899.99], ["updated_at", "2025-04-24 13:59:57.293617"], ["id", 980190963]]