app/controllers/products_controller.rb

    def index
      products = Product.all
---
SELECT "products".* FROM "products"

    def create
      product = Product.new(product_params)
      if product.save
---
INSERT INTO "products" ("name", "description", "price", "available", "created_at", "updated_at") VALUES ('MacBook Pro', 'High-performance laptop', 1999.99, 1, '2025-04-24 13:13:40.914064', '2025-04-24 13:13:40.914064') RETURNING "id"

    def update
      if @product.update(product_params)
---
UPDATE "products" SET "name" = 'Galaxy S 8', "description" = 'Brand New phone with lots of color and case', "updated_at" = '2025-04-24 22:35:11.510245' WHERE "products"."id" = 7